In [1]:
import numpy as np
import pandas as pd

In [2]:
# importing the data file
# file 1 and file 2

In [4]:

result = pd.read_csv('result.csv')
students = pd.read_csv('students.csv')

In [3]:
result = pd.read_csv('result.csv')
result

    Unnamed: 0 seating no  Percentage Result   class
0            1       J301          59   Pass   third
1            2       J302          77   Pass   first
2            3       J303          89   Pass   first
3            4       J304          18   Fail    fail
4            5       J305          86   Pass   first
5            6       J306          50   Pass   third
6            7       J307          80   Pass   first
7            8       J308          50   Pass   third
8            9       J309          28   Fail    fail
9           10       J310          92   Pass   first
10          11       J311          24   Fail    fail
11          12       J312          74   Pass  second
12          13       J313          42   Pass   third
13          14       J314          42   Pass   third
14          15       J315          84   Pass   first
15          16       J316          40   Pass   third
16          17       J317          50   Pass   third
17          18       J318          74   Pass  second
18          19       J319          81   Pass   first
19          20       J320          18   Fail    fail

In [4]:
students = pd.read_csv('students.csv')
students

    sr no Roll no         name  class
0       1    J301      Aaditya      8
1       2    J302        Aarya      8
2       3    J303        Abhay      8
3       4    J304     Abhijeet      8
4       5    J305   Abhinandan      8
..    ...     ...          ...    ...
95     96    J396       Ujjwal      9
96     97    J397         Vasu      9
97     98    J398        Vidit      9
98     99    J399        Vijay      9
99    100    J400      Vishvas      9

[100 rows x 4 columns]

In [5]:
# understanding the data 
#  finding shape,size ,ndim
# data inside the tables

In [6]:
result.shape

(20, 5)

In [7]:
students.shape

(100, 4)

In [8]:
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  20 non-null     int64
 1   seating no  20 non-null     object
 2   Percentage  20 non-null     int64
 3   Result      20 non-null     object
 4   class       20 non-null     object
dtypes: int64(2), object(3)
memory usage: 928.0+ bytes

In [9]:
result.describe()

       Unnamed: 0  Percentage
count    20.00000   20.000000
mean     10.50000   57.900000
std       5.91608   24.865745
min       1.00000   18.000000
25%       5.75000   41.500000
50%      10.50000   54.500000
75%      15.25000   80.250000
max      20.00000   92.000000

In [10]:
students.info() # to check NUll , missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   sr no    100 non-null    int64
 1   Roll no  100 non-null    object
 2   name     100 non-null    object
 3   class    100 non-null    int64
dtypes: int64(2), object(2)
memory usage: 3.2+ KB

In [11]:
students.describe()

            sr no       class
count  100.000000  100.000000
mean    50.500000    8.700000
std     29.011492    0.460566
min      1.000000    8.000000
25%     25.750000    8.000000
50%     50.500000    9.000000
75%     75.250000    9.000000
max    100.000000    9.000000

In [13]:
# finding if all the seating numbers are there in roll no from other tabls
# checking if the givenset is superset

In [28]:
students['Roll no']

0     J301
1     J302
2     J303
3     J304
4     J305
      ...
95    J396
96    J397
97    J398
98    J399
99    J400
Name: Roll no, Length: 100, dtype: object

In [30]:
result['seating no']

0     J301
1     J302
2     J303
3     J304
4     J305
5     J306
6     J307
7     J308
8     J309
9     J310
10    J311
11    J312
12    J313
13    J314
14    J315
15    J316
16    J317
17    J318
18    J319
19    J320
Name: seating no, dtype: object

In [29]:
result['seating no'].isin(students['Roll no'])

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
18    True
19    True
Name: seating no, dtype: bool

In [26]:
result.iloc[:,1]

0     J301
1     J302
2     J303
3     J304
4     J305
5     J306
6     J307
7     J308
8     J309
9     J310
10    J311
11    J312
12    J313
13    J314
14    J315
15    J316
16    J317
17    J318
18    J319
19    J320
Name: seating no, dtype: object

In [31]:
# to check if the list is very lenghty and to check if  all the values are true
# use all()

# 1. any() :  
# 2. all() :

In [ ]:
# any :  all the elemets should be zero for o/p to be False : behaves like OR
# all : all the elemets should be non-zero for o/p to be True : behaves like AND
# True and False

In [32]:
# using any() to check if all the boolean values are TRUE
#  this will ensure that all the student are there in the results list

In [33]:
np.any(result['seating no'].isin(students['Roll no']))

True

In [12]:
# assumputions
# we will keep all the data related to results
# let left be result
# let right be students
#  we have to perform left outer join

In [35]:
students.columns

Index(['sr no', 'Roll no', 'name', 'class'], dtype='object')

In [36]:
result.columns

Index(['Unnamed: 0', 'seating no', 'Percentage', 'Result', 'class'], dtype='object')

In [38]:
result.merge(students,left_on='seating no',right_on='Roll no',how='inner') #how='inner' is the default

,Unnamed: 0,seating no,Percentage,Result,class_x,sr no,Roll no,name,class_y
0,1,J301,59,Pass,third,1,J301,Aaditya,8
1,2,J302,77,Pass,first,2,J302,Aarya,8
2,3,J303,89,Pass,first,3,J303,Abhay,8
3,4,J304,18,Fail,fail,4,J304,Abhijeet,8
4,5,J305,86,Pass,first,5,J305,Abhinandan,8
5,6,J306,50,Pass,third,6,J306,Abhinay,8
6,7,J307,80,Pass,first,7,J307,Abhishek,8
7,8,J308,50,Pass,third,8,J308,Abimanyu,8
8,9,J309,28,Fail,fail,9,J309,Aditya,8
9,10,J310,92,Pass,first,10,J310,Akhil,8
10,11,J311,24,Fail,fail,11,J311,Akshat,8
11,12,J312,74,Pass,second,12,J312,Anil,8
12,13,J313,42,Pass,third,13,J313,Avi,8
13,14,J314,42,Pass,third,14,J314,Balaraam,8
14,15,J315,84,Pass,first,15,J315,Bharat,8
15,16,J316,40,Pass,third,16,J316,Bhaskar,8
16,17,J317,50,Pass,third,17,J317,Bhaumik,8
17,18,J318,74,Pass,second,18,J318,Bijay,8
18,19,J319,81,Pass,first,19,J319,Brijesh,8
19,20,J320,18,Fail,fail,20,J320,Chandan,8

In [ ]:
# try with diff values for how= ?
result.merge(students,left_on='seating no',right_on='Roll no',how='inner') #how='inner' is the default

In [44]:
result.merge(students,left_on='seating no',right_on='Roll no',how='inner')

,Unnamed: 0,seating no,Percentage,Result,class_x,sr no,Roll no,name,class_y
0,1,J301,59,Pass,third,1,J301,Aaditya,8
1,2,J302,77,Pass,first,2,J302,Aarya,8
2,3,J303,89,Pass,first,3,J303,Abhay,8
3,4,J304,18,Fail,fail,4,J304,Abhijeet,8
4,5,J305,86,Pass,first,5,J305,Abhinandan,8
5,6,J306,50,Pass,third,6,J306,Abhinay,8
6,7,J307,80,Pass,first,7,J307,Abhishek,8
7,8,J308,50,Pass,third,8,J308,Abimanyu,8
8,9,J309,28,Fail,fail,9,J309,Aditya,8
9,10,J310,92,Pass,first,10,J310,Akhil,8
10,11,J311,24,Fail,fail,11,J311,Akshat,8
11,12,J312,74,Pass,second,12,J312,Anil,8
12,13,J313,42,Pass,third,13,J313,Avi,8
13,14,J314,42,Pass,third,14,J314,Balaraam,8
14,15,J315,84,Pass,first,15,J315,Bharat,8
15,16,J316,40,Pass,third,16,J316,Bhaskar,8
16,17,J317,50,Pass,third,17,J317,Bhaumik,8
17,18,J318,74,Pass,second,18,J318,Bijay,8
18,19,J319,81,Pass,first,19,J319,Brijesh,8
19,20,J320,18,Fail,fail,20,J320,Chandan,8

In [15]:
# new coln labels after merging ??
# class_x 
# class_y

In [50]:
# removing the unwanted columns

In [53]:
result.merge(students,left_on='seating no',right_on='Roll no',how='inner').drop('Unnamed: 0',axis=1)

   seating no  Percentage Result class_x  sr no Roll no         name  class_y
0        J301          59   Pass   third      1    J301      Aaditya        8
1        J302          77   Pass   first      2    J302        Aarya        8
2        J303          89   Pass   first      3    J303        Abhay        8
3        J304          18   Fail    fail      4    J304     Abhijeet        8
4        J305          86   Pass   first      5    J305   Abhinandan        8
5        J306          50   Pass   third      6    J306      Abhinay        8
6        J307          80   Pass   first      7    J307     Abhishek        8
7        J308          50   Pass   third      8    J308     Abimanyu        8
8        J309          28   Fail    fail      9    J309       Aditya        8
9        J310          92   Pass   first     10    J310        Akhil        8
10       J311          24   Fail    fail     11    J311       Akshat        8
11       J312          74   Pass  second     12    J312         Anil        8
12       J313          42   Pass   third     13    J313          Avi        8
13       J314          42   Pass   third     14    J314     Balaraam        8
14       J315          84   Pass   first     15    J315       Bharat        8
15       J316          40   Pass   third     16    J316      Bhaskar        8
16       J317          50   Pass   third     17    J317      Bhaumik        8
17       J318          74   Pass  second     18    J318        Bijay        8
18       J319          81   Pass   first     19    J319      Brijesh        8
19       J320          18   Fail    fail     20    J320      Chandan        8

In [54]:
# removing multiple columns

In [56]:
result.merge(students,left_on='seating no',right_on='Roll no',how='inner').drop(['Unnamed: 0','seating no','class_x'],axis=1)

    Percentage Result  sr no Roll no         name  class_y
0           59   Pass      1    J301      Aaditya        8
1           77   Pass      2    J302        Aarya        8
2           89   Pass      3    J303        Abhay        8
3           18   Fail      4    J304     Abhijeet        8
4           86   Pass      5    J305   Abhinandan        8
5           50   Pass      6    J306      Abhinay        8
6           80   Pass      7    J307     Abhishek        8
7           50   Pass      8    J308     Abimanyu        8
8           28   Fail      9    J309       Aditya        8
9           92   Pass     10    J310        Akhil        8
10          24   Fail     11    J311       Akshat        8
11          74   Pass     12    J312         Anil        8
12          42   Pass     13    J313          Avi        8
13          42   Pass     14    J314     Balaraam        8
14          84   Pass     15    J315       Bharat        8
15          40   Pass     16    J316      Bhaskar        8
16          50   Pass     17    J317      Bhaumik        8
17          74   Pass     18    J318        Bijay        8
18          81   Pass     19    J319      Brijesh        8
19          18   Fail     20    J320      Chandan        8